{"name":"Ernani Joppert","summary":"My professional experience is related to software development, architecture, design and performance tuning. I've also worked on data warehousing projects and business intelligence projects using commercial products such as PowerCenter and PowerDesigner. I am involved into JEE (former J2EE) Architecture, .Net, Flex, AIR, PHP Web based solutions and Mobile. Also develop on client side and webservices. I've worked on health, banking and insurance and EAI projects, along as with an internet solution provider, which tended to provide entertainment to end customers through quality of life, news, games, etc. I've worked abroad in Germany,\nto a small software development company in a Car insurance and Car Leasing Configuration System, using EuroTAX/Schwacke data model, Struts and Java Server Faces presentation Tier, along with Persistence using Hibernate framework and IBatis. My professional goals are to work abroad, acquire experience living and working in different countries and expand my knowledge as well as challenges. Specialties: JEE (former J2EE) framework, Java, JSP, JSF, SOAP, Axis, PHP, XML, SAML, Rest, Websphere, Jboss, BEA Weblogic, Tomcat, Struts, Eclipse, SWT, Swing, Hibernate, AMF, Flex, Adobe AIR, ActionScript development as well as DB2, Oracle, MySQL, SQL Server and other development solutions to achieve customer needs.","experience":"Application Integration / Web Identity at IBM Global Services\nJanuary 2005 - Present (10 years 2 months)\nTechnical consultant for Web Identity project at IBM Global Services, support and manage application integration with SSO (Tivoli Access Manager/WebSEAL) and custom based SOA Profiling for internal and external adopters, Business Partners profiling, authentication and entitlement, SAAJ and Federation also involved.\n5 recommendations available upon request\nPHP Consultant at PHPSP - PHP User Group in São Paulo\n2001 - Present (14 years)\nFounded the php-sp list on yahoo groups by answering their questions, also contributed to the PHP group fixing a few bugs as well as the PHP documentation translation to Brazilian Portuguese, attended some events and tried to help the users to share their knowledge. Also done some free lances here and there related to PHP, such as Wordpress setup, a blog commenting system and OSCommerce personalization.\n1 recommendation available upon request\nOpen Source App Development (Community Developer) at Spare Time Open Source Developer\n2009 - 2011 (2 years)\nIndependant Sr. Java EE/J2SE Consultant at Java/JEE Architect / Consultant\n1999 - 2010 (11 years)\nProvided several development solutions using the Java2SE and JEE technologies, both as an Architect Role as well as a lead developer. The variations included Web Applications, j2me applications (mobile), desktop applications using SWT, Swing and AWT, Unit Testing and Batch Applications to run at scheduled periods of time to process loads of information with or without JDBC, JMS, RMI, IIOP, JBoss and MQ systems.\nBusiness Intelligence/ETL Developer at BI and DW Consultant\n1999 - 2009 (10 years)\nProvided solutions and adjustments on several DW projects, ensuring Data Quality through ETL and BI concepts both based on relational data models and OLAP, using the common Data Warehousing techniques such as SnowFlake and StarSchema, Ad Hoc Queries and Data Quality in small and big data sets.\nWebsphere specialist at Websphere/Java Consultant\n2004 - 2004 (less than a year)\nProvided Advices on Java Development, training, recommendations, advices, articles and suggestions to a wide variety of friends and co-workers alike\n1 recommendation available upon request\nSystem Architect and J2EE Developer at Savista Corporation (former NewPOS International)\n2002 - 2004 (2 years)\nI've adjusted an existing reporting tool that was responsible for providing a KPI reporting, Fraud detection and other features for Domino Pizza in US. After that, transitioned to the NewPOS team which I've assisted in the development of the Java/J2EE Version of the POS at the version 8.X, also worked in a TDD environment, multi-threading Java Development and Raw TCP/IP communication mechanism.\n1 recommendation available upon request\nJava Software Architect (Consultant) at Ericsson\n2002 - 2002 (less than a year)\nDeveloped a integration between Ericsson's EHTP Setler for Interconnection and Brazil's tax rules to provide a way to calculate interconnection fees based off on call types. Worked with BMP (Billing Mediation Platform) with TCL/TK and C/C++ for file processing of CDR (Call Data Records) Also worked on a Java2 solution to address fixes of CDR's. Also worked on a project where it had the ability to process measurement of usage and critical analysis and fraud detection of measured services on telephony.\nSenior Web Developer at Internet Group do Brasil\n2000 - 2001 (1 year)\n1 recommendation available upon request\nWeb Developer at iG\n2000 - 2001 (1 year)\nI was responsible for the Development and Improvement of Árvore da Vida website, and then transitioned to the Software Factory Team which began developing paid services, such as numerology reports, astrology maps, and other paid services alike.\n1 recommendation available upon request\nTechnical Support and Intranet Software Development at Sudameris Corretora de Cambio e Valores Mobiliários\n1996 - 2000 (4 years)\nProvided User Technical Support, Intranet web development, Home Broker web development with Java Applets, Ticket Emission System using MS Visual Basic, Lotus Notes and Network Administration.\n1 recommendation available upon request","languages":"English","skills":"& Expertise\nJSP\nEclipse Tomcat Hibernate Struts MySQL\nJava JSF SOAP\nWebsphere Flex\nJBoss XML PHP\nSwing AMFPHP SWT\nAxis EJB J2EE\nWeb Services UML\nScrum AJAX\nDesign Patterns JavaScript SAML\nSubversion Spring PL/SQL\nDelphi CVS\nServlets jQuery Ant Apache JSON\nLinux SOA\nMaven DB2 REST CSS\nSQL Server Weblogic C++\nGit J2MEJSP\nEclipse Tomcat Hibernate Struts MySQL\nJava JSF SOAP\nWebsphere Flex\nJBoss XML PHP\nSwing AMFPHP SWT\nAxis EJB J2EE\nWeb Services UML\nScrum AJAX\nDesign Patterns JavaScript SAML\nSubversion Spring PL/SQL\nDelphi CVS\nServlets jQuery Ant Apache JSON\nLinux SOA\nMaven DB2 REST CSS\nSQL Server Weblogic C++\nGit J2ME","objective":"-C\nJava Enterprise Edition","education":"Universidade Paulista\nBachelor of Business Administration (B.B.A.), Business Administration and Management, General, 1999 - 2001","interests":"Java, J2EE, JEE, technology, web development, multi tier software architecture, entrepreneurship, Hibernate, Adobe Air, Adobe Flex, MySQL, PHP, J2ME, C, C++, SQL, DB2, Oracle, MySQL, Gaming, XNA Framework\nErnani Joppert P Martins\nSoftware Engineer / Lead Architect\n11 people have recommended Ernani\n\"One of the greatest web developer I have had opportunity to work with at IBM. Learning is just you can get from him, excellent knowledge, responsible, excellent developer and excellent person. During several years we have worked together, Always friendly, focused and compromise describe him. Ernani is a great\nelement, any team or enterprise will be proud to have such a great developer, he talks by its own work but, he is strongly recommended for any challenges, leading teams. And as a great person and friend.\"\n— Gabriel G., IT SPECIALIST, IBM, worked directly with Ernani at IBM Global Services\n\"This is the greatest web developer I have had opportunity to manage among many at IBM. It is difficult to scope Ernani's qualities, só many are they só I will point some such as *deep knowledge *fast execution\n*innovative problem solving approach *personal commitment *drive to achieve. One day, one of my Java development teams were fighting to deliver a large piece of code they have worked 3 days and nights...\nThe four of them were almost giving up when I suggested Ernani to take a look... He sits, opens The code, inspects it... In 15min he was able to fix it and they met The deadline. This java team was composed of The very best except for Ernani. During The time We havê worked together, I saw many displays of his\ncompetence at global level. Always calm, always friendly, always fixing impossível codes. Ernani programs in every language and understands quickly The most intricate business situtations. I strongly recommend Ernani for ANY development challenges, leading teams.\"\nCarlos G., GBS Application Services - Information & Data Management Leader (DBA Center of Competency Mgr), IBM, managed Ernani at IBM Global Services\n\"Working together with Ernani 5 years ago made me only have good recommendations about him. Ernani is a committed professional that holds great technical skills and problem solving ability in whatever he works on. Meanwhile, his friendly nature makes it easy to work in a team. It would be a pleasure to work with him again.\"\nJuliana R., Technical Consultant, IBMWeb Identity AIT, worked directly with Ernani at IBM Global Services\n\"Ernani is one of the most talented technical people I have worked. He is focused and full of bright ideas. His abilities are not constrained only in the technical field but also to address business needs with revolutionary\nsolutions either technically enabling or improving processes. I strongly recommend him as an extremely creative and motivated professional.\"\nFábio H., Info & Data Mgmt CoC Manager, IBM, worked directly with Ernani at IBM Global Services\n\"Ernani is a very intelligent guy. I remember several discussions we had about a lot of issues, about architectures, about ideas, about implementing systems. He is very smart, and if you ask him something, he can give you very interesting ideas. I know I can count on him if I need. I recommend Ernani and I hope to work with him again in the future.\"\nFernando G., IT Specialist, IBM Brazil, worked directly with Ernani at IBM Global Services\n\"Ernani is a great developer and friend. Always striving to learn more about technology so he can be better prepared for greater technical challenges. It is always good to count with the collaboration and technical feedback of such a qualified developer like Ernani.\"\nManuel L., Owner, PHP Classes repository, worked directly with Ernani at PHPSP - PHP User Group in São Paulo\n\"Uma pessoa que admiro muito. Um profissional singular, completo e dedicado. Faltam adjetivos para poder mensurar sua competência. Recomendadíssimo!\"\nDani K., Social media manager, Garage Interactive Marketing, was with another company when working with Ernani at Websphere/Java Consultant\n\"Ernani well as a great friend is an excellent professional of Technology, always updated, intelligent and patient. I recommend this excellent professional.\"\nAnderson S., Programmer Analyst TCL/C/C++, NewPos International, was a consultant or contractor to Ernani at Savista Corporation (former NewPOS International)\n\"Ernani is a great computer analyst. He self learned some programing languages like Perl, PHP and Java. After iG he started alone some Internet projects like a virtual shopping and a payment gateway. He is serious and focused guy.\"\nSandro E., Developement Manager, iG - Internet Group do Brasil, worked directly with Ernani at Internet Group do Brasil\n\"Ernani is a focused developer, he love techonology and inspires any person to work. He have strong knowlogement in Java plataform, and know web services deeply. At Internet Group (iG) we made some website to support millions of views. I recommend Ernani, he is a great profissional.\"\nSandro E., Developement Manager, iG - Internet Group do Brasil, worked directly with Ernani at iG\n\"O Ernani é uma pessoa determinada e muito competente. Possui conhecimento técnico avançado, capacidade analítica e experiência para gerenciar o alcance eficiente de metas e resultados.\"\nJose Eduardo F., Controladoria e Consultoria, Banco Sudameris de Investimento, was with another company when working with Ernani at Sudameris Corretora de Cambio e Valores Mobiliários\nContact Ernani on LinkedIn\nPage1\nPage1"}