{"name":"Alex Dubinchyk","email":"alexs.dbk@gmail.com","objective":"Seeking a challenging position to use my software Web development and process optimization skills.","summary":"I worked on a wide range of products including building advanced dynamic multi language web sites,\ninternal and external API's, well as creating new internal workflows. My goal is to work in a passionate team,\nthat loves their work and the products they are creating together, supporting, mentoring, optimizing workflows and\ncreating high quality software.\nI'm energenic, solution oriented team-player, constantly learning and growing as a team, and bringing high spirits\nalong with me.","technology":"Server side PHP programming, REST, OPP, MVC, Yii framework.\nSQL Database programming: MySQL, SQL, MSSQL.\nClient-side programming: JavaScript, AJAX, jQuery.\nSmarty Template Engine, HTML5, CSS3.\nWebserver installation and configuration: Apache, Nginx, IIS.\nSource control: SVN/Subversion, GIT.\nPlatforms: Linux, Mac, Windows.","skills":"Server side PHP programming, REST, OPP, MVC, Yii framework.\nSQL Database programming: MySQL, SQL, MSSQL.\nClient-side programming: JavaScript, AJAX, jQuery.\nSmarty Template Engine, HTML5, CSS3.\nWebserver installation and configuration: Apache, Nginx, IIS.\nSource control: SVN/Subversion, GIT.\nPlatforms: Linux, Mac, Windows.","experience":"Actuate http://www.actuate.com/\nFull stack PHP Developer\nSan Manteo, CA. November 2014 - current\nImplemented web service(API, MVC, Php)\nIntroduced Git to the team\nBloomSky http://www.bloomsky.com\nBackend Developer\nSunnyvale, CA. October 2014 - November 2014\nIntegrated APIs (PHP, Python, Django, Nginx)\nSet up PHPUnit and functional testing\nDeploy merge DB script (MSSQL>MySQL)\nRozumsoft LLC, / Telecontact LLC\nhttp://www.telecontact.ru/\nFull stack PHP Developer\nBelarus, Minsk. February 2012 - September 2014\nProgramming modules of dynamically building statistics for quality control assessment\nproject.\nDesigned and developed project quality control assessment that estimated effective work of operators in\ncallcenters from different regions. Includes modules separation mapping based on more 20 users roles(RBAC),\nonline editors(logs, statistical formulas, projects rules and etc) for more 10k clients.\nFinalization coding script of internal protection algorithm authorization and validation.\nProgramming API service for quality control assessment. Interact with user interface(AJAX) with fast load up\nJSON data, audio files and extract large data in excel.\nAPI data exchange integrated with data parse, merge, view in table linkage, send emails. Support more 100\nsource, near 1000 onlineusers, more 10 servers.\nCodes cross-browsers users interfaces in project quality control assessment, using Javascript, jQuery, JSON,\nBootstrap.\nDeveloped JavaScript audio player with individual custom design, hardware acceleration, deceleration and the\norder to play audio files.\nDesigned and developed the company website ( http://www.rozumsoft.com/ ).\nImplemented 3 domain zones(ru/by/com) algorithm.\nCodes contents editor for 3 languages\nFixed and support custom seo map logic.\nDeveloped scripts products to callcenters operators\nDevelopment of сomplex reports and statistical summaries by Cisco data telephony.\nRedesigned and reimplemented projects using MVC approach and strong OOP design\nDesigned and conversion of scripts database, extensive SQL query optimization.\nReal Estate Agency Assistant heals LLC, Full stack PHP Developer\nBelarus, Minsk, http://www.a-h.by ; May 2011 - January 2012\nDynamic website design and programming using PHP, MySQL, HTML, CSS. Setup and administration of web servers\nand server software.\nBusiness consulting of securing/ planning project.\nDevelopment to online marketing, search engine placement and promotion ( http://www.mogu.by ;\nhttp://www.a-h.by ).","education":"Belarusian University of Informatics and Radioelectronics,\nBS in Modeling and computer-aided design of radioelectronics devices."}